SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_synth.h
/* Bit fields for SYNTH SEQIF */
#define _SYNTH_SEQIF_RESETVALUE                       0x00000000UL                          /**< Default value for SYNTH_SEQIF               */
#define _SYNTH_SEQIF_MASK                             0x00000237UL                          /**< Mask for SYNTH_SEQIF                        */
#define SYNTH_SEQIF_LOCKED                            (0x1UL << 0)                          /**< Synthesizer locked Interrupt Flag           */
#define _SYNTH_SEQIF_LOCKED_SHIFT                     0                                     /**< Shift value for SYNTH_LOCKED                */
#define _SYNTH_SEQIF_LOCKED_MASK                      0x1UL                                 /**< Bit mask for SYNTH_LOCKED                   */
#define _SYNTH_SEQIF_LOCKED_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_LOCKED_DEFAULT                    (_SYNTH_SEQIF_LOCKED_DEFAULT << 0)    /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_UNLOCKED                          (0x1UL << 1)                          /**< Synthesizer unlocked Interrupt Flag         */
#define _SYNTH_SEQIF_UNLOCKED_SHIFT                   1                                     /**< Shift value for SYNTH_UNLOCKED              */
#define _SYNTH_SEQIF_UNLOCKED_MASK                    0x2UL                                 /**< Bit mask for SYNTH_UNLOCKED                 */
#define _SYNTH_SEQIF_UNLOCKED_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_UNLOCKED_DEFAULT                  (_SYNTH_SEQIF_UNLOCKED_DEFAULT << 1)  /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_SYRDY                             (0x1UL << 2)                          /**< Synthesizer ready Interrupt Flag            */
#define _SYNTH_SEQIF_SYRDY_SHIFT                      2                                     /**< Shift value for SYNTH_SYRDY                 */
#define _SYNTH_SEQIF_SYRDY_MASK                       0x4UL                                 /**< Bit mask for SYNTH_SYRDY                    */
#define _SYNTH_SEQIF_SYRDY_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_SYRDY_DEFAULT                     (_SYNTH_SEQIF_SYRDY_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_VCOHIGH                           (0x1UL << 4)                          /**< VCO high voltage Interrupt Flag             */
#define _SYNTH_SEQIF_VCOHIGH_SHIFT                    4                                     /**< Shift value for SYNTH_VCOHIGH               */
#define _SYNTH_SEQIF_VCOHIGH_MASK                     0x10UL                                /**< Bit mask for SYNTH_VCOHIGH                  */
#define _SYNTH_SEQIF_VCOHIGH_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_VCOHIGH_DEFAULT                   (_SYNTH_SEQIF_VCOHIGH_DEFAULT << 4)   /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_VCOLOW                            (0x1UL << 5)                          /**< VCO low voltage Interrupt Flag              */
#define _SYNTH_SEQIF_VCOLOW_SHIFT                     5                                     /**< Shift value for SYNTH_VCOLOW                */
#define _SYNTH_SEQIF_VCOLOW_MASK                      0x20UL                                /**< Bit mask for SYNTH_VCOLOW                   */
#define _SYNTH_SEQIF_VCOLOW_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_VCOLOW_DEFAULT                    (_SYNTH_SEQIF_VCOLOW_DEFAULT << 5)    /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_LOCNTDONE                         (0x1UL << 9)                          /**< LOCNT measurement done Interrupt Flag       */
#define _SYNTH_SEQIF_LOCNTDONE_SHIFT                  9                                     /**< Shift value for SYNTH_LOCNTDONE             */
#define _SYNTH_SEQIF_LOCNTDONE_MASK                   0x200UL                               /**< Bit mask for SYNTH_LOCNTDONE                */
#define _SYNTH_SEQIF_LOCNTDONE_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_LOCNTDONE_DEFAULT                 (_SYNTH_SEQIF_LOCNTDONE_DEFAULT << 9) /**< Shifted mode DEFAULT for SYNTH_SEQIF        */

/* Bit fields for SYNTH SEQIEN */
#define _SYNTH_SEQIEN_RESETVALUE                      0x00000000UL                           /**< Default value for SYNTH_SEQIEN              */
#define _SYNTH_SEQIEN_MASK                            0x00000237UL                           /**< Mask for SYNTH_SEQIEN                       */
#define SYNTH_SEQIEN_LOCKED                           (0x1UL << 0)                           /**< LOCKED Interrupt Enable                     */
#define _SYNTH_SEQIEN_LOCKED_SHIFT                    0                                      /**< Shift value for SYNTH_LOCKED                */
#define _SYNTH_SEQIEN_LOCKED_MASK                     0x1UL                                  /**< Bit mask for SYNTH_LOCKED                   */
#define _SYNTH_SEQIEN_LOCKED_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_LOCKED_DEFAULT                   (_SYNTH_SEQIEN_LOCKED_DEFAULT << 0)    /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_UNLOCKED                         (0x1UL << 1)                           /**< UNLOCKED Interrupt Enable                   */
#define _SYNTH_SEQIEN_UNLOCKED_SHIFT                  1                                      /**< Shift value for SYNTH_UNLOCKED              */
#define _SYNTH_SEQIEN_UNLOCKED_MASK                   0x2UL                                  /**< Bit mask for SYNTH_UNLOCKED                 */
#define _SYNTH_SEQIEN_UNLOCKED_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_UNLOCKED_DEFAULT                 (_SYNTH_SEQIEN_UNLOCKED_DEFAULT << 1)  /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_SYRDY                            (0x1UL << 2)                           /**< CAPCALDONE Interrupt Enable                 */
#define _SYNTH_SEQIEN_SYRDY_SHIFT                     2                                      /**< Shift value for SYNTH_SYRDY                 */
#define _SYNTH_SEQIEN_SYRDY_MASK                      0x4UL                                  /**< Bit mask for SYNTH_SYRDY                    */
#define _SYNTH_SEQIEN_SYRDY_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_SYRDY_DEFAULT                    (_SYNTH_SEQIEN_SYRDY_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_VCOHIGH                          (0x1UL << 4)                           /**< VCOHIGH Interrupt Enable                    */
#define _SYNTH_SEQIEN_VCOHIGH_SHIFT                   4                                      /**< Shift value for SYNTH_VCOHIGH               */
#define _SYNTH_SEQIEN_VCOHIGH_MASK                    0x10UL                                 /**< Bit mask for SYNTH_VCOHIGH                  */
#define _SYNTH_SEQIEN_VCOHIGH_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_VCOHIGH_DEFAULT                  (_SYNTH_SEQIEN_VCOHIGH_DEFAULT << 4)   /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_VCOLOW                           (0x1UL << 5)                           /**< VCOLOW Interrupt Enable                     */
#define _SYNTH_SEQIEN_VCOLOW_SHIFT                    5                                      /**< Shift value for SYNTH_VCOLOW                */
#define _SYNTH_SEQIEN_VCOLOW_MASK                     0x20UL                                 /**< Bit mask for SYNTH_VCOLOW                   */
#define _SYNTH_SEQIEN_VCOLOW_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_VCOLOW_DEFAULT                   (_SYNTH_SEQIEN_VCOLOW_DEFAULT << 5)    /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_LOCNTDONE                        (0x1UL << 9)                           /**< LOCNTDONE Interrupt Enable                  */
#define _SYNTH_SEQIEN_LOCNTDONE_SHIFT                 9                                      /**< Shift value for SYNTH_LOCNTDONE             */
#define _SYNTH_SEQIEN_LOCNTDONE_MASK                  0x200UL                                /**< Bit mask for SYNTH_LOCNTDONE                */
#define _SYNTH_SEQIEN_LOCNTDONE_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_LOCNTDONE_DEFAULT                (_SYNTH_SEQIEN_LOCNTDONE_DEFAULT << 9) /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */

/* Bit fields for SYNTH SFMIF */
#define _SYNTH_SFMIF_RESETVALUE                       0x00000000UL                               /**< Default value for SYNTH_SFMIF               */
#define _SYNTH_SFMIF_MASK                             0x00000237UL                               /**< Mask for SYNTH_SFMIF                        */
#define SYNTH_SFMIF_LOCKEDSFMIF                       (0x1UL << 0)                               /**< Synthesizer locked Interrupt Flag           */
#define _SYNTH_SFMIF_LOCKEDSFMIF_SHIFT                0                                          /**< Shift value for SYNTH_LOCKEDSFMIF           */
#define _SYNTH_SFMIF_LOCKEDSFMIF_MASK                 0x1UL                                      /**< Bit mask for SYNTH_LOCKEDSFMIF              */
#define _SYNTH_SFMIF_LOCKEDSFMIF_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for SYNTH_SFMIF                */
#define SYNTH_SFMIF_LOCKEDSFMIF_DEFAULT               (_SYNTH_SFMIF_LOCKEDSFMIF_DEFAULT << 0)    /**< Shifted mode DEFAULT for SYNTH_SFMIF        */
#define SYNTH_SFMIF_UNLOCKEDSFMIF                     (0x1UL << 1)                               /**< Synthesizer unlocked Interrupt Flag         */
#define _SYNTH_SFMIF_UNLOCKEDSFMIF_SHIFT              1                                          /**< Shift value for SYNTH_UNLOCKEDSFMIF         */
#define _SYNTH_SFMIF_UNLOCKEDSFMIF_MASK               0x2UL                                      /**< Bit mask for SYNTH_UNLOCKEDSFMIF            */
#define _SYNTH_SFMIF_UNLOCKEDSFMIF_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for SYNTH_SFMIF                */
#define SYNTH_SFMIF_UNLOCKEDSFMIF_DEFAULT             (_SYNTH_SFMIF_UNLOCKEDSFMIF_DEFAULT << 1)  /**< Shifted mode DEFAULT for SYNTH_SFMIF        */
#define SYNTH_SFMIF_SYRDYSFMIF                        (0x1UL << 2)                               /**< Synthesizer ready Interrupt Flag            */
#define _SYNTH_SFMIF_SYRDYSFMIF_SHIFT                 2                                          /**< Shift value for SYNTH_SYRDYSFMIF            */
#define _SYNTH_SFMIF_SYRDYSFMIF_MASK                  0x4UL                                      /**< Bit mask for SYNTH_SYRDYSFMIF               */
#define _SYNTH_SFMIF_SYRDYSFMIF_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for SYNTH_SFMIF                */
#define SYNTH_SFMIF_SYRDYSFMIF_DEFAULT                (_SYNTH_SFMIF_SYRDYSFMIF_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYNTH_SFMIF        */
#define SYNTH_SFMIF_VCOHIGHSFMIF                      (0x1UL << 4)                               /**< VCO high voltage Interrupt Flag             */
#define _SYNTH_SFMIF_VCOHIGHSFMIF_SHIFT               4                                          /**< Shift value for SYNTH_VCOHIGHSFMIF          */
#define _SYNTH_SFMIF_VCOHIGHSFMIF_MASK                0x10UL                                     /**< Bit mask for SYNTH_VCOHIGHSFMIF             */
#define _SYNTH_SFMIF_VCOHIGHSFMIF_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SYNTH_SFMIF                */
#define SYNTH_SFMIF_VCOHIGHSFMIF_DEFAULT              (_SYNTH_SFMIF_VCOHIGHSFMIF_DEFAULT << 4)   /**< Shifted mode DEFAULT for SYNTH_SFMIF        */
#define SYNTH_SFMIF_VCOLOWSFMIF                       (0x1UL << 5)                               /**< VCO low voltage Interrupt Flag              */
#define _SYNTH_SFMIF_VCOLOWSFMIF_SHIFT                5                                          /**< Shift value for SYNTH_VCOLOWSFMIF           */
#define _SYNTH_SFMIF_VCOLOWSFMIF_MASK                 0x20UL                                     /**< Bit mask for SYNTH_VCOLOWSFMIF              */
#define _SYNTH_SFMIF_VCOLOWSFMIF_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for SYNTH_SFMIF                */
#define SYNTH_SFMIF_VCOLOWSFMIF_DEFAULT               (_SYNTH_SFMIF_VCOLOWSFMIF_DEFAULT << 5)    /**< Shifted mode DEFAULT for SYNTH_SFMIF        */
#define SYNTH_SFMIF_LOCNTDONESFMIF                    (0x1UL << 9)                               /**< LOCNT measurement done Interrupt Flag       */
#define _SYNTH_SFMIF_LOCNTDONESFMIF_SHIFT             9                                          /**< Shift value for SYNTH_LOCNTDONESFMIF        */
#define _SYNTH_SFMIF_LOCNTDONESFMIF_MASK              0x200UL                                    /**< Bit mask for SYNTH_LOCNTDONESFMIF           */
#define _SYNTH_SFMIF_LOCNTDONESFMIF_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for SYNTH_SFMIF                */
#define SYNTH_SFMIF_LOCNTDONESFMIF_DEFAULT            (_SYNTH_SFMIF_LOCNTDONESFMIF_DEFAULT << 9) /**< Shifted mode DEFAULT for SYNTH_SFMIF        */

/* Bit fields for SYNTH SFMIEN */
#define _SYNTH_SFMIEN_RESETVALUE                      0x00000000UL                                 /**< Default value for SYNTH_SFMIEN              */
#define _SYNTH_SFMIEN_MASK                            0x00000237UL                                 /**< Mask for SYNTH_SFMIEN                       */
#define SYNTH_SFMIEN_LOCKEDSFMIEN                     (0x1UL << 0)                                 /**< LOCKED Interrupt Enable                     */
#define _SYNTH_SFMIEN_LOCKEDSFMIEN_SHIFT              0                                            /**< Shift value for SYNTH_LOCKEDSFMIEN          */
#define _SYNTH_SFMIEN_LOCKEDSFMIEN_MASK               0x1UL                                        /**< Bit mask for SYNTH_LOCKEDSFMIEN             */
#define _SYNTH_SFMIEN_LOCKEDSFMIEN_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for SYNTH_SFMIEN               */
#define SYNTH_SFMIEN_LOCKEDSFMIEN_DEFAULT             (_SYNTH_SFMIEN_LOCKEDSFMIEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for SYNTH_SFMIEN       */
#define SYNTH_SFMIEN_UNLOCKEDSFMIEN                   (0x1UL << 1)                                 /**< UNLOCKED Interrupt Enable                   */
#define _SYNTH_SFMIEN_UNLOCKEDSFMIEN_SHIFT            1                                            /**< Shift value for SYNTH_UNLOCKEDSFMIEN        */
#define _SYNTH_SFMIEN_UNLOCKEDSFMIEN_MASK             0x2UL                                        /**< Bit mask for SYNTH_UNLOCKEDSFMIEN           */
#define _SYNTH_SFMIEN_UNLOCKEDSFMIEN_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for SYNTH_SFMIEN               */
#define SYNTH_SFMIEN_UNLOCKEDSFMIEN_DEFAULT           (_SYNTH_SFMIEN_UNLOCKEDSFMIEN_DEFAULT << 1)  /**< Shifted mode DEFAULT for SYNTH_SFMIEN       */
#define SYNTH_SFMIEN_SYRDYSFMIEN                      (0x1UL << 2)                                 /**< CAPCALDONE Interrupt Enable                 */
#define _SYNTH_SFMIEN_SYRDYSFMIEN_SHIFT               2                                            /**< Shift value for SYNTH_SYRDYSFMIEN           */
#define _SYNTH_SFMIEN_SYRDYSFMIEN_MASK                0x4UL                                        /**< Bit mask for SYNTH_SYRDYSFMIEN              */
#define _SYNTH_SFMIEN_SYRDYSFMIEN_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for SYNTH_SFMIEN               */
#define SYNTH_SFMIEN_SYRDYSFMIEN_DEFAULT              (_SYNTH_SFMIEN_SYRDYSFMIEN_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYNTH_SFMIEN       */
#define SYNTH_SFMIEN_VCOHIGHSFMIEN                    (0x1UL << 4)                                 /**< VCOHIGH Interrupt Enable                    */
#define _SYNTH_SFMIEN_VCOHIGHSFMIEN_SHIFT             4                                            /**< Shift value for SYNTH_VCOHIGHSFMIEN         */
#define _SYNTH_SFMIEN_VCOHIGHSFMIEN_MASK              0x10UL                                       /**< Bit mask for SYNTH_VCOHIGHSFMIEN            */
#define _SYNTH_SFMIEN_VCOHIGHSFMIEN_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for SYNTH_SFMIEN               */
#define SYNTH_SFMIEN_VCOHIGHSFMIEN_DEFAULT            (_SYNTH_SFMIEN_VCOHIGHSFMIEN_DEFAULT << 4)   /**< Shifted mode DEFAULT for SYNTH_SFMIEN       */
#define SYNTH_SFMIEN_VCOLOWSFMIEN                     (0x1UL << 5)                                 /**< VCOLOW Interrupt Enable                     */
#define _SYNTH_SFMIEN_VCOLOWSFMIEN_SHIFT              5                                            /**< Shift value for SYNTH_VCOLOWSFMIEN          */
#define _SYNTH_SFMIEN_VCOLOWSFMIEN_MASK               0x20UL                                       /**< Bit mask for SYNTH_VCOLOWSFMIEN             */
#define _SYNTH_SFMIEN_VCOLOWSFMIEN_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for SYNTH_SFMIEN               */
#define SYNTH_SFMIEN_VCOLOWSFMIEN_DEFAULT             (_SYNTH_SFMIEN_VCOLOWSFMIEN_DEFAULT << 5)    /**< Shifted mode DEFAULT for SYNTH_SFMIEN       */
#define SYNTH_SFMIEN_LOCNTDONESFMIEN                  (0x1UL << 9)                                 /**< LOCNTDONE Interrupt Enable                  */
#define _SYNTH_SFMIEN_LOCNTDONESFMIEN_SHIFT           9                                            /**< Shift value for SYNTH_LOCNTDONESFMIEN       */
#define _SYNTH_SFMIEN_LOCNTDONESFMIEN_MASK            0x200UL                                      /**< Bit mask for SYNTH_LOCNTDONESFMIEN          */
#define _SYNTH_SFMIEN_LOCNTDONESFMIEN_DEFAULT         0x00000000UL                                 /**< Mode DEFAULT for SYNTH_SFMIEN               */
#define SYNTH_SFMIEN_LOCNTDONESFMIEN_DEFAULT          (_SYNTH_SFMIEN_LOCNTDONESFMIEN_DEFAULT << 9) /**< Shifted mode DEFAULT for SYNTH_SFMIEN       */

/** @} End of group EFR32FG25_SYNTH_BitFields */
/** @} End of group EFR32FG25_SYNTH */
/** @} End of group Parts */

#endif /* EFR32FG25_SYNTH_H */
